# FinalVerificationWork
/* 
Задача: Написать программу, которая из имеющегося массива строк
 формирует новый массив из строк, длина которых меньше, 
 либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, 
 либо задать на старте выполнения алгоритма. 
 При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
*/

//Решение задачи: 

//Изначально задан строчный массив с 8 элементами различного вида:
string[] strArr = { "Hello", "212", "Wed", ":))", "GB", "Phrases", "Rap", "God" };

//Программа выводит для пользователя соответствующее сообщение, а затем и отображает заданный массив, используя оператор итерации "for":

Console.WriteLine($"Заданный строчный массив: ");

for (int i = 0; i < strArr.Length; i++)
    {
        Console.Write($"{strArr[i]}, ");
    }

Console.WriteLine();

// Затем, используя указанный выше оператор итерации "for", программа подсчитывает длинну элементов каждого элемента строчного массива, а оператор ветвления "if"  позволяет установить искомые элементы, длинна которых меньше либо равна трём. Полученный результат выводиться в консоль. 

Console.WriteLine("Новый строчный массив из символов, длина которых <= 3: ");

for (int i = 0; i < strArr.Length; i++)
    if (strArr[i].Length <= 3)
    {
        Console.Write($"{strArr[i]}, ");
    }
